/********************************************************************************
  * @file    tim.h 
  * @author  Huangzhibin
  * @version V1.0.0
  * @date    5-4-2016
  * @brief   Header for tim.c module
*******************************************************************************/ 
#ifndef __TIM_H
#define __TIM_H
#include "stm32f10x.h"  		
#include "stm32f10x_tim.h"

//**********************************************************************************//
//Macro definition area:Define the parameters of the device
//**********************************************************************************//
/****************************** START parameters define *****************************/

//任务执行时间标志
extern uint32_t	time_1_task_ms,time_2_task_ms,time_3_task_ms;




//**********************************************************************************//
//Function definition area:All functions defined in the file
//**********************************************************************************//
/***************************** START Function definition ****************************/
void TIM1_Configuration(void) ;
/****************************** END Function definition *****************************/
//**********************************************************************************//
	 
#endif	/* _TIM_ */

/******************* (C) COPYRIGHT 2016 Huangzhibin*****END OF FILE****/
